TestCases/HumidityFluxBC/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform  0.2; // based on the z0m=0.075 in [boundary] in clear_sky.ini file, with considering initial u, v profiles from 0/U.

boundaryField
{
    earth
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    cblTop
    {
        type            slip;
    }
    
    // LEFT-RIGHT SIDES:
    cblLeft
    {
        type            cyclic;
    }
    cblRight
    {
        type            cyclic;
    }
    
    // FRONT-BACK SIDES if 3D:
    cblFront
    {
        type            cyclic;
    }

    cblBack
    {
        type            cyclic;
    }
}


// ************************************************************************* //
